app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @article = Article.find_by(id: params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-02-28 02:18:14.469679"], ["id", 1]]
---
  def update
    @article = Article.find_by(id: params[:id])
    @article.title = params[:article][:title]
    @article.description = params[:article][:description]
    if @article.save